In [1]:
import pandas as pd

In [4]:
import numpy as np
df=pd.read_csv('bmw.csv')
df

,model,year,price,transmission,mileage,fuelType,tax,mpg,engineSize
0,2 Series,2018,16250,Manual,10401,Petrol,145,52.3,1.5
1,5 Series,2014,11200,Automatic,67068,Diesel,125,57.6,2.0
2,6 Series,2018,27000,Automatic,14827,Petrol,145,42.8,2.0
3,5 Series,2016,16000,Automatic,62794,Diesel,160,51.4,3.0
4,1 Series,2017,12750,Automatic,26676,Diesel,145,72.4,1.5
...,...,...,...,...,...,...,...,...,...
10776,X3,2016,19000,Automatic,40818,Diesel,150,54.3,2.0
10777,5 Series,2016,14600,Automatic,42947,Diesel,125,60.1,2.0
10778,3 Series,2017,13100,Manual,25468,Petrol,200,42.8,2.0
10779,1 Series,2014,9930,Automatic,45000,Diesel,30,64.2,2.0
10780,X1,2017,15981,Automatic,59432,Diesel,125,57.6,2.0

VALUE COUNTS QUESTIONS

How many cars of each model are there?

In [28]:
df.value_counts('model').reset_index().head()

       model  count
0   3 Series   2443
1   1 Series   1969
2   2 Series   1228
3   5 Series   1055
4   4 Series    995

How many cars of each fuel type are there?

In [27]:
df.value_counts('fuelType').reset_index().head()

   fuelType  count
0    Diesel   7027
1    Petrol   3417
2    Hybrid    298
3     Other     36
4  Electric      3


How many cars of each transmission type are there?

In [26]:
df['transmission'].value_counts().reset_index().head()

  transmission  count
0    Semi-Auto   4666
1    Automatic   3588
2       Manual   2527

How many cars of each year are there?

In [25]:
df['year'].value_counts().reset_index().head()

   year  count
0  2019   3485
1  2016   1882
2  2017   1721
3  2015    922
4  2018    848

How many cars of each engine size are there?

In [24]:
df['engineSize'].value_counts().reset_index().head()

   engineSize  count
0         2.0   6575
1         3.0   2458
2         1.5   1463
3         1.6    109
4         4.4     79


How many cars of each model + fuel type combination are there?

In [23]:
df[['model','fuelType']].value_counts().reset_index().head()

       model fuelType  count
0   3 Series   Diesel   1764
1   1 Series   Diesel   1110
2   1 Series   Petrol    859
3   5 Series   Diesel    805
4   4 Series   Diesel    682

In [ ]:
How many cars of each model + transmission combination are there?

In [22]:
df.value_counts(['model','transmission']).reset_index().head()

       model transmission  count
0   1 Series       Manual   1103
1   3 Series    Semi-Auto   1075
2   3 Series    Automatic    830
3   3 Series       Manual    538
4   5 Series    Semi-Auto    519


How many cars are there for each model + fuel type combination?

In [21]:
df[['model','fuelType']].value_counts().reset_index().head()

       model fuelType  count
0   3 Series   Diesel   1764
1   1 Series   Diesel   1110
2   1 Series   Petrol    859
3   5 Series   Diesel    805
4   4 Series   Diesel    682

How many cars are there for each model + transmission combination?

In [29]:
df[['model','transmission']].value_counts().reset_index().head()

       model transmission  count
0   1 Series       Manual   1103
1   3 Series    Semi-Auto   1075
2   3 Series    Automatic    830
3   3 Series       Manual    538
4   5 Series    Semi-Auto    519

How many cars are there for each fuel type + transmission combination?

In [30]:
df[['fuelType','transmission']].value_counts().reset_index().head()

  fuelType transmission  count
0   Diesel    Semi-Auto   2908
1   Diesel    Automatic   2489
2   Petrol    Semi-Auto   1652
3   Diesel       Manual   1630
4   Petrol       Manual    897

How many cars are there for each model + year combination?

In [31]:
df[['model','year']].value_counts().reset_index().head()

       model  year  count
0   3 Series  2019    658
1   2 Series  2019    488
2   1 Series  2019    454
3   1 Series  2016    434
4   1 Series  2017    414

GROUP-BY QUESTIONS


What is the average price for each model?

In [34]:
bdf=df.groupby(['model']).agg(
    avg_price = ('price','mean')).reset_index().head()
bdf

       model     avg_price
0   1 Series  15821.670391
1   2 Series  19542.050489
2   3 Series  19880.857962
3   4 Series  22498.418090
4   5 Series  22548.174408

What is the average mileage for each model?

In [39]:
bdf = df.groupby(['model']).agg(
    avg_mileage = ('mileage','mean')
).reset_index().head()
bdf.sort_values('avg_mileage',ascending = False)

       model   avg_mileage
2   3 Series  31858.368400
4   5 Series  30726.992417
0   1 Series  27916.201117
3   4 Series  21786.536683
1   2 Series  17048.013029


What is the average mpg for each model?

In [46]:
df.head()
bdf = df.groupby(['model']).agg(
    avg_mpg = ('mpg','mean')
).reset_index().head()
bdf

       model    avg_mpg
0   1 Series  57.673083
1   2 Series  55.866124
2   3 Series  58.062996
3   4 Series  55.511357
4   5 Series  62.096872

What is the average price for each fuel type

In [48]:
df.head()
bdf = df.groupby(['fuelType']).agg(
    avg_price= ('price','mean')
).reset_index().head()
bdf

   fuelType     avg_price
0    Diesel  21779.262986
1  Electric  18466.000000
2    Hybrid  27169.714765
3     Other  18193.861111
4    Petrol  24360.271583


What is the average price for each transmission type?

In [55]:
df.head()
bdf= df.groupby(['transmission']).agg(
    Avg_price_trans = ('price','mean')
).reset_index().head()
bdf
bdf.sort_values('Avg_price_trans',ascending=False)

  transmission  Avg_price_trans
2    Semi-Auto     27359.747964
0    Automatic     22419.023969
1       Manual     14637.451128

What is the average price for each year?

In [58]:
df.head()
bdf = df.groupby(['year']).agg(
    avg_price_year = ('price','mean')
).reset_index().head()
bdf

   year  avg_price_year
0  1996          5995.0
1  1997          3950.0
2  1998          3950.0
3  1999          3285.0
4  2000          1624.5


What is the highest price for each model?

In [61]:
df.head()
bdf = df.groupby(['model']).agg(
    highest_price = ('price','max')
).reset_index().head()
bdf.sort_values('highest_price',ascending=False)

       model  highest_price
1   2 Series         123456
2   3 Series          71990
4   5 Series          54845
3   4 Series          48155
0   1 Series          38555

What is the lowest price for each model?

In [64]:
df.head()
bdf = df.groupby(['model']).agg(
    lowest_price = ('price','min')
).reset_index().head()
bdf.sort_values('lowest_price',ascending=False)

       model  lowest_price
3   4 Series          8500
1   2 Series          5895
4   5 Series          1595
0   1 Series          1500
2   3 Series          1200


What is the average mileage for each fuel type?

In [67]:
df.head()
bdf = df.groupby(['fuelType']).agg(
    avg_mileage_fuel = ('mileage','mean')
).reset_index().head()
bdf.sort_values('avg_mileage_fuel',ascending=False)

   fuelType  avg_mileage_fuel
3     Other      44760.638889
0    Diesel      29852.804042
2    Hybrid      23400.530201
1  Electric      19925.333333
4    Petrol      16524.097454

What is the average price for each engine size?

In [69]:
df.head()
bdf = df.groupby(['engineSize']).agg(
    avg_price_engineSize = ('price','mean')
).reset_index().head()
bdf.sort_values('avg_price_engineSize',ascending =False)

   engineSize  avg_price_engineSize
0         0.0          18425.404255
1         0.6          17920.000000
2         1.0          17400.000000
3         1.5          17258.086124
4         1.6           9353.330275

What is the average price for each model + fuel type combination?

In [71]:
df.head()
bdf = df.groupby(['model','fuelType']).agg(
    avg_Price = ('price','mean')
).reset_index().head()
bdf.sort_values('avg_Price',ascending=False)

       model fuelType     avg_Price
3   2 Series   Hybrid  20667.694444
2   2 Series   Diesel  18555.802218
1   1 Series   Petrol  17950.154831
4   2 Series    Other  14666.666667
0   1 Series   Diesel  14174.491892

What is the average mileage for each model + year combination?

In [74]:
df.head()
bdf = df.groupby(['model','year','fuelType']).agg(
    avg_mileage = ('mileage','mean')
).reset_index().head()
bdf.sort_values('avg_mileage',ascending=False)

       model  year fuelType  avg_mileage
1   1 Series  2004   Diesel     112000.0
3   1 Series  2006   Diesel      90000.0
4   1 Series  2006   Petrol      88000.0
2   1 Series  2005   Diesel      63547.0
0   1 Series  2001   Petrol      22633.0


How many cars are listed in each model group?

In [81]:
df.head()
bdf = df.groupby(['model',]).agg(
    model_counts = ('model','value_counts')
).reset_index().head()
bdf.sort_values('model_counts',ascending=False)

       model  model_counts
2   3 Series          2443
0   1 Series          1969
1   2 Series          1228
4   5 Series          1055
3   4 Series           995

In [80]:
df.value_counts('model').reset_index().head()

       model  count
0   3 Series   2443
1   1 Series   1969
2   2 Series   1228
3   5 Series   1055
4   4 Series    995

How many cars are listed in each fuel type group?

In [82]:
df.value_counts('fuelType').reset_index().head()

   fuelType  count
0    Diesel   7027
1    Petrol   3417
2    Hybrid    298
3     Other     36
4  Electric      3

What is the average mpg for each fuel type?

In [84]:
df.head()
bdf = df.groupby(['fuelType']).agg(
    avg_mpg = ('mpg','mean')
).sort_index().head()
bdf.sort_values('avg_mpg',ascending=False)

             avg_mpg
fuelType
Electric  470.800000
Other     199.363889
Hybrid    156.876846
Diesel     57.790835
Petrol     42.904009

What is the average mileage for each transmission type?

In [86]:
df.head()
bdf = df.groupby(['transmission']).agg(
    avg_mileage = ('mileage','mean')
).reset_index().head()
bdf.sort_values('avg_mileage',ascending=False)

  transmission   avg_mileage
1       Manual  34720.485160
0    Automatic  31830.679487
2    Semi-Auto  15631.347621

What is the average price for cars with low vs high mileage?

In [91]:
df.head()

bdf =  df.groupby(['mileage']).agg(avg_price = ('price','mean'),
max_price = ('price','max'),
min_price = ('price','min')
).reset_index().head()
bdf

   mileage     avg_price  max_price  min_price
0        1  24490.000000      24490      24490
1        3  58999.000000      58999      58999
2        4  27494.500000      28990      25999
3        5  34470.227273      73000      23990
4        6  31588.250000      45990      25450

What is the average price for each mpg range?

In [94]:
df.head()
bdf = df.groupby(['mpg']).agg(
    avg_mpg = ('price','mean')
)
bdf.head()

           avg_mpg
mpg
5.5   50812.666667
8.8   35974.125000
19.1  12495.000000
20.8  10999.000000
21.9  16950.000000

What is the average engine size for each model?

In [96]:
df.head()
bdf = df.groupby(['model']).agg(
    avg_engine_size = ('engineSize',"mean")
)
bdf.head()

          avg_engine_size
model
1 Series         1.884865
2 Series         1.873779
3 Series         2.183095
4 Series         2.243216
5 Series         2.225687

What is the average price for each model and year?

In [100]:
df.head()
bdf = df.groupby(['model','year']).agg(
    avg_price = ('price','mean')
)
bdf.head()

               avg_price
model    year
1 Series 2001    13000.0
         2004     2495.0
         2005     3795.0
         2006     2992.5
         2007     1500.0

What is the average price for each year and fuel type?

In [103]:
df.head()
bdf = df.groupby(['year','fuelType']).agg(
    avg_price = ('price','mean')
)
bdf.head()

               avg_price
year fuelType
1996 Petrol       5995.0
1997 Petrol       3950.0
1998 Petrol       3950.0
1999 Petrol       3285.0
2000 Petrol       1624.5

What is the average mileage for each year?

In [106]:
df.head()
bdf = df.groupby(['year']).agg(
    avg_mileage = ('mileage','mean')
)
bdf.head()

      avg_mileage
year
1996     36000.00
1997     49000.00
1998     56500.00
1999     66557.75
2000     96104.50

What is the highest mileage for each model?

In [110]:
df.head()
bdf = df.groupby(['model']).agg(
    highest_mileage = ('mileage','max')
)
bdf.head()

          highest_mileage
model
1 Series           167000
2 Series           133670
3 Series           190000
4 Series           141300
5 Series           178987


What is the lowest mpg for each model?

In [112]:
df.head()
bdf = df.groupby(['model']).agg(
    lowest_mpg = ('mpg','min')
)
bdf.head()

          lowest_mpg
model
1 Series        32.5
2 Series        32.5
3 Series         8.8
4 Series        34.0
5 Series        23.7

What is the average price grouped by number of cylinders (engineSize) categories?

In [115]:
df.head()
bdf = df.groupby(['engineSize']).agg(
    avg_price = ('price','mean')
)
bdf.head()

               avg_price
engineSize
0.0         18425.404255
0.6         17920.000000
1.0         17400.000000
1.5         17258.086124
1.6          9353.330275

What is the average price of Petrol, Diesel, and Hybrid cars within each model?

In [119]:
df.head()
bdf = df.groupby(['model','fuelType']).agg(
    avg_price = ('price','mean')
)
bdf.head()

                      avg_price
model    fuelType
1 Series Diesel    14174.491892
         Petrol    17950.154831
2 Series Diesel    18555.802218
         Hybrid    20667.694444
         Other     14666.666667

What is the average mileage for each model and transmission type?

In [121]:
bdf = df.groupby(['model','transmission']).agg(
    avg_mileage = ('mileage','mean')
)
bdf.head()

                        avg_mileage
model    transmission
1 Series Automatic     27122.573407
         Manual        32977.600181
         Semi-Auto     17428.629703
2 Series Automatic     19940.577558
         Manual        21124.973236

How many cars are in each model + engine size group?

In [130]:
bdf = df.value_counts(['model','engineSize']).reset_index().head()
bdf

       model  engineSize  count
0   3 Series         2.0   1897
1   1 Series         1.5    833
2   5 Series         2.0    820
3   1 Series         2.0    794
4   4 Series         2.0    753

What is the average price for cars with different mpg ranges?

In [132]:
df.head()
bdf  = df.groupby(['mpg']).agg(
    avg_price = ('price','mean')
)
bdf.head()

         avg_price
mpg
5.5   50812.666667
8.8   35974.125000
19.1  12495.000000
20.8  10999.000000
21.9  16950.000000

What is the average price for cars grouped by (fuel type + transmission)?

In [134]:
df.head()
bdf = df.groupby(['fuelType','transmission']).agg(
    avg_price = ('price','mean')
)
bdf.head()

                          avg_price
fuelType transmission
Diesel   Automatic     21216.705504
         Manual        13722.741104
         Semi-Auto     26776.627579
Electric Automatic     18466.000000
Hybrid   Automatic     25543.463542